app/Http/Controllers/CursosController.php

select * from `cursos` where `cursos`.`categoria_id` = 1 and `cursos`.`categoria_id` is not null limit 15 offset 0
select count(*) as aggregate from `cursos` where `cursos`.`categoria_id` = 1 and `cursos`.`categoria_id` is not null
---
    public function index(Categoria $categoria)
    {
        $cursos = $categoria->cursos()->paginate(15);