app/Http/Controllers/DisciplinasController.php

select * from `disciplinas` where `disciplinas`.`curso_id` = 6 and `disciplinas`.`curso_id` is not null limit 15 offset 0
select count(*) as aggregate from `disciplinas` where `disciplinas`.`curso_id` = 6 and `disciplinas`.`curso_id` is not null
---
    public function index(Curso $curso)
    {
        $disciplinas = $curso->disciplinas()->paginate(15);