app/Models/Categoria.php

    protected static function catcursos()
    {
         return DB::table('cursos')
        ->SELECT(DB::raw('count(*) as qtd_cursos, nome_categoria, categoria_id'))
        ->join('categorias', 'categorias.id', '=', 'cursos.categoria_id')
        ->groupBy('nome_categoria', 'categoria_id')
        ->paginate(15);
---
select count(*) as qtd_cursos, nome_categoria, categoria_id from `cursos` inner join `categorias` on `categorias`.`id` = `cursos`.`categoria_id` group by `nome_categoria`, `categoria_id` limit 15 offset 0